In [1]:
# https://pandas.pydata.org/docs/user_guide/dsintro.html#dsintro
import numpy as np
import pandas as pd
import dateutil
from IPython.display import display

In [6]:
np.random.randn(5)

array([-0.4896487 ,  0.20851252,  1.24181779,  0.57964882, -1.11507435])

# Series 
is a one-dimensional labeled array capable of holding any data type (integers, strings, floating point numbers, Python objects, etc.). The axis labels are collectively referred to as the index.

In [7]:
s = pd.Series(np.random.randn(5))
s

0    0.205476
1    0.884010
2   -0.045670
3   -1.010133
4   -1.105759
dtype: float64

In [8]:
s = pd.Series(np.random.randn(5), index=["a", "b", "c", "d", "e"])
s

a   -0.547911
b    0.134973
c    1.552563
d    0.354914
e   -1.535210
dtype: float64

In [9]:
s.index

Index(['a', 'b', 'c', 'd', 'e'], dtype='object')

In [10]:
# from Dict
d = {"b": 1, "a": 0, "c": 2}
pd.Series(d)

b    1
a    0
c    2
dtype: int64

In [11]:
pd.Series(d, index=["b", "c", "d", "a"])

b    1.0
c    2.0
d    NaN
a    0.0
dtype: float64

In [12]:
# from scalar value.
# In NumPy, a scalar is any object that you put in an array.
pd.Series(5.0, index=["a", "b", "c", "d", "e"])

a    5.0
b    5.0
c    5.0
d    5.0
e    5.0
dtype: float64

In [18]:
s

a   -0.547911
b    0.134973
c    1.552563
d    0.354914
e   -1.535210
dtype: float64

In [13]:
s[0]

-0.5479109298834558

In [14]:
s[:3]

a   -0.547911
b    0.134973
c    1.552563
dtype: float64

In [16]:
s.median()

0.13497329219474996

In [15]:
s[s > s.median()]

c    1.552563
d    0.354914
dtype: float64

In [17]:
s[[4, 3, 1]]

e   -1.535210
d    0.354914
b    0.134973
dtype: float64

In [19]:
s.dtype

dtype('float64')

In [20]:
s.array

<PandasArray>
[-0.5479109298834558, 0.13497329219474996,  1.5525633042800853,
  0.3549144317624558, -1.5352104071865904]
Length: 5, dtype: float64

In [21]:
s.to_numpy()

array([-0.54791093,  0.13497329,  1.5525633 ,  0.35491443, -1.53521041])

In [22]:
s["a"]

-0.5479109298834558

# DataFrame 
is a 2-dimensional labeled data structure with columns of potentially different types. You can think of it like a spreadsheet or SQL table, or a dict of Series objects.

In [33]:
# create an empty dataframe
df = pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [4]:
# create dataframe from series
d = {
    "one": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "two": pd.Series([1.0, 2.0, 3.0, 4.0], index=["a", "b", "c", "d"]),
}

In [5]:
df = pd.DataFrame(d)
df

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [6]:
print(df)

   one  two
a  1.0  1.0
b  2.0  2.0
c  3.0  3.0
d  NaN  4.0

In [7]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [9]:
for i in range(len(df)):
    print(df.index[i])

a
b
c
d

In [58]:
df.describe()
display(df.head(3))

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0

In [57]:
# use display() for html like format and print multiple items in the same sell.
display(df.describe())
display(df.head(3))

            one       two
count  4.000000  4.000000
mean   2.500000  2.500000
std    1.290994  1.290994
min    1.000000  1.000000
25%    1.750000  1.750000
50%    2.500000  2.500000
75%    3.250000  3.250000
max    4.000000  4.000000

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0

In [52]:
df.head(2)

   one  two
0  1.0  4.0
1  2.0  3.0

In [26]:
df.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [27]:
df.columns

Index(['one', 'two'], dtype='object')

In [45]:
# create dataframe from list
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}
df_d = pd.DataFrame(d)
df_d

   one  two
0  1.0  4.0
1  2.0  3.0
2  3.0  2.0
3  4.0  1.0

In [3]:
df = pd.DataFrame({'a':[1,2,np.nan,np.nan], 'b':[4,np.nan,6,np.nan], 'c':[np.nan, 8,9,np.nan], 'd':[np.nan,np.nan,np.nan,np.nan]})
df

     a    b    c   d
0  1.0  4.0  NaN NaN
1  2.0  NaN  8.0 NaN
2  NaN  6.0  9.0 NaN
3  NaN  NaN  NaN NaN

In [4]:
df.notnull().any(axis = 0)

a     True
b     True
c     True
d    False
dtype: bool

In [5]:
df = df.loc[:, df.notnull().any(axis = 0)]
df.head()

     a    b    c
0  1.0  4.0  NaN
1  2.0  NaN  8.0
2  NaN  6.0  9.0
3  NaN  NaN  NaN

In [5]:
x = pd.Series(np.random.randn(10))
x

0    0.942524
1    0.284539
2    0.366176
3    0.177671
4    0.462394
5    0.376161
6   -0.613501
7    0.187062
8    1.791046
9    1.353027
dtype: float64

In [8]:
wgt = np.ones(x.shape, np.float64) 
wgt = pd.Series(wgt)
type(wgt)
_d = wgt[~np.isnan(x)].sum()
_d

10.0

## change index

In [46]:
df_d = pd.DataFrame(d, index=["a", "b", "c", "d"])
df_d

   one  two
a  1.0  4.0
b  2.0  3.0
c  3.0  2.0
d  4.0  1.0

In [30]:
# from a list of dicts
data2 = [{"a": 1, "b": 2}, {"a": 5, "b": 10, "c": 20}]
pd.DataFrame(data2)

   a   b     c
0  1   2   NaN
1  5  10  20.0

In [31]:
pd.DataFrame(data2, index=["first", "second"])

        a   b     c
first   1   2   NaN
second  5  10  20.0

In [32]:
pd.DataFrame(data2, columns=["a", "b"])

   a   b
0  1   2
1  5  10

In [9]:
df3 = pd.DataFrame([{"a": 1, "b": 2, "c": None}])
df3

   a  b     c
0  1  2  None

In [3]:
feats = ['a', 'b']
df3[feats]

   a  b
0  1  2

In [4]:
feats = ['a', 'b', 'c', 'd']
df4 = df3[feats].fillna(np.NaN)
df4

   a  b   c
0  1  2 NaN

In [20]:
# df4 is still a dataframe.
type(df4)

pandas.core.frame.DataFrame

In [17]:
df3.columns.values

array(['a', 'b', 'c'], dtype=object)

## add a new column

In [12]:
df4 = df3.join(pd.DataFrame(columns=["d", "e"]))
df4

   a  b     c    d    e
0  1  2  None  NaN  NaN

In [11]:
df4 = df3.join(pd.DataFrame(columns=["d", "e"])).fillna(0)
df4

   a  b  c  d  e
0  1  2  0  0  0

In [13]:
# it can be empty
df3 = df3.join(pd.DataFrame(columns=[]))
df3

   a  b     c
0  1  2  None

## loc[ ]
* dataframe.loc[specified rows: specified columns]
* .loc[ ] is both a dataframe and series method, meaning we can call the loc method on either of these pandas objects.
* https://towardsdatascience.com/how-to-use-loc-in-pandas-49ed348a4117

In [25]:
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [2.0, 4.0, 6.0, 8.0], "three": [3.0, 6.0, 9.0, 12.0]}
df = pd.DataFrame(d)
df

   one  two  three
0  1.0  2.0    3.0
1  2.0  4.0    6.0
2  3.0  6.0    9.0
3  4.0  8.0   12.0

In [26]:
df.loc[2, :]

one      3.0
two      6.0
three    9.0
Name: 2, dtype: float64

In [27]:
df.loc[[0, 2], :]

   one  two  three
0  1.0  2.0    3.0
2  3.0  6.0    9.0

In [28]:
df.loc[[0, 2], ['two']]

   two
0  2.0
2  6.0

In [29]:
df.loc[0:2, 'one':'three']

   one  two  three
0  1.0  2.0    3.0
1  2.0  4.0    6.0
2  3.0  6.0    9.0

In [30]:
df.one == 3

0    False
1    False
2     True
3    False
Name: one, dtype: bool

In [31]:
df.loc[df.one == 3,:]

   one  two  three
2  3.0  6.0    9.0

In [32]:
df.loc[lambda _df: df.one == 3, :]

   one  two  three
2  3.0  6.0    9.0

In [35]:
df.loc[df.one == 3, 'one':'two']

   one  two
2  3.0  6.0

# astype()

In [21]:
d = {'col1': ['1', '2'], 'col2': ['3', '4']}
df = pd.DataFrame(data=d)
print(df)
print(df.dtypes)

  col1 col2
0    1    3
1    2    4
col1    object
col2    object
dtype: object

In [14]:
df['col1'] = df['col1'].astype(int)
print(df)
print(df.dtypes)

   col1 col2
0     1    3
1     2    4
col1     int64
col2    object
dtype: object

In [22]:
print(df.astype('int32').dtypes)
print(df.dtypes)

col1    int32
col2    int32
dtype: object
col1    object
col2    object
dtype: object

# change column value based on condition

In [31]:
df = pd.DataFrame({'c1': list('abcdefg')})
df

  c1
0  a
1  b
2  c
3  d
4  e
5  f
6  g

In [32]:
df.loc[df['c1'] == 'd', 'c1'] = 10
df

   c1
0   a
1   b
2   c
3  10
4   e
5   f
6   g

# groupby()

In [31]:
# Load data from csv file
data = pd.read_csv('../../data/phone_data.csv')
data

     index            date  duration  item    month   network network_type
0        0  15/10/14 06:58    34.429  data  2014-11      data         data
1        1  15/10/14 06:58    13.000  call  2014-11  Vodafone       mobile
2        2  15/10/14 14:46    23.000  call  2014-11    Meteor       mobile
3        3  15/10/14 14:48     4.000  call  2014-11     Tesco       mobile
4        4  15/10/14 17:27     4.000  call  2014-11     Tesco       mobile
..     ...             ...       ...   ...      ...       ...          ...
825    825  13/03/15 00:38     1.000   sms  2015-03     world        world
826    826  13/03/15 00:39     1.000   sms  2015-03  Vodafone       mobile
827    827  13/03/15 06:58    34.429  data  2015-03      data         data
828    828  14/03/15 00:13     1.000   sms  2015-03     world        world
829    829  14/03/15 00:16     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [34]:
# Convert date from string to date times
data['date'] = data['date'].apply(dateutil.parser.parse, dayfirst=True)
data

     index                date  duration  item    month   network network_type
0        0 2014-10-15 06:58:00    34.429  data  2014-11      data         data
1        1 2014-10-15 06:58:00    13.000  call  2014-11  Vodafone       mobile
2        2 2014-10-15 14:46:00    23.000  call  2014-11    Meteor       mobile
3        3 2014-10-15 14:48:00     4.000  call  2014-11     Tesco       mobile
4        4 2014-10-15 17:27:00     4.000  call  2014-11     Tesco       mobile
..     ...                 ...       ...   ...      ...       ...          ...
825    825 2015-03-13 00:38:00     1.000   sms  2015-03     world        world
826    826 2015-03-13 00:39:00     1.000   sms  2015-03  Vodafone       mobile
827    827 2015-03-13 06:58:00    34.429  data  2015-03      data         data
828    828 2015-03-14 00:13:00     1.000   sms  2015-03     world        world
829    829 2015-03-14 00:16:00     1.000   sms  2015-03     world        world

[830 rows x 7 columns]

In [35]:
data.dtypes

index                    int64
date            datetime64[ns]
duration               float64
item                    object
month                   object
network                 object
network_type            object
dtype: object

In [36]:
data.groupby(['month']).groups.keys()

dict_keys(['2014-11', '2014-12', '2015-01', '2015-02', '2015-03'])

In [37]:
len(data.groupby(['month']).groups['2014-11'])

230

In [38]:
# Get the first entry for each month
data.groupby('month').first()

         index                date  duration  item   network network_type
month
2014-11      0 2014-10-15 06:58:00    34.429  data      data         data
2014-12    228 2014-11-13 06:58:00    34.429  data      data         data
2015-01    381 2014-12-13 06:58:00    34.429  data      data         data
2015-02    577 2015-01-13 06:58:00    34.429  data      data         data
2015-03    729 2015-02-12 20:15:00    69.000  call  landline     landline

In [39]:
# Get the sum of the durations per month
data.groupby('month')['duration'].sum()

month
2014-11    26639.441
2014-12    14641.870
2015-01    18223.299
2015-02    15522.299
2015-03    22750.441
Name: duration, dtype: float64

In [40]:
# Get the number of dates / entries in each month
data.groupby('month')['date'].count()

month
2014-11    230
2014-12    157
2015-01    205
2015-02    137
2015-03    101
Name: date, dtype: int64

In [41]:
# What is the sum of durations, for calls only, to each network
data[data['item'] == 'call'].groupby('network')['duration'].sum()

network
Meteor        7200.0
Tesco        13828.0
Three        36464.0
Vodafone     14621.0
landline     18433.0
voicemail     1775.0
Name: duration, dtype: float64

In [42]:
# How many calls, sms, and data entries are in each month?
data.groupby(['month', 'item'])['date'].count()

month    item
2014-11  call    107
         data     29
         sms      94
2014-12  call     79
         data     30
         sms      48
2015-01  call     88
         data     31
         sms      86
2015-02  call     67
         data     31
         sms      39
2015-03  call     47
         data     29
         sms      25
Name: date, dtype: int64

# M

## math

In [11]:
d = {
    "c1": pd.Series([1.0, 2.0, 3.0], index=["a", "b", "c"]),
    "c2": pd.Series([2.0, 3.0, 4.0, 5.0], index=["a", "b", "c", "d"]),
    "c3": pd.Series([3.0, 4.0, 5.0], index=["a", "b", "c"]),
}
df = pd.DataFrame(d)
df

    c1   c2   c3
a  1.0  2.0  3.0
b  2.0  3.0  4.0
c  3.0  4.0  5.0
d  NaN  5.0  NaN

In [12]:
df['r1'] = df['c1']/df['c3']
df

    c1   c2   c3        r1
a  1.0  2.0  3.0  0.333333
b  2.0  3.0  4.0  0.500000
c  3.0  4.0  5.0  0.600000
d  NaN  5.0  NaN       NaN

In [13]:
df['r2'] = df['c1']/df['c2']
df

    c1   c2   c3        r1        r2
a  1.0  2.0  3.0  0.333333  0.500000
b  2.0  3.0  4.0  0.500000  0.666667
c  3.0  4.0  5.0  0.600000  0.750000
d  NaN  5.0  NaN       NaN       NaN

# pivot()

In [4]:
df = pd.read_csv("../../data/weather.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/2/2017  new york           66        58
2  5/3/2017  new york           68        60
3  5/1/2017    mumbai           75        80
4  5/2/2017    mumbai           78        83
5  5/3/2017    mumbai           82        85
6  5/1/2017   beijing           80        26
7  5/2/2017   beijing           77        30
8  5/3/2017   beijing           79        35

In [5]:
df.index

RangeIndex(start=0, stop=9, step=1)

In [6]:
df.pivot(index='date', columns='city')

         temperature                 humidity
city         beijing mumbai new york  beijing mumbai new york
date
5/1/2017          80     75       65       26     80       56
5/2/2017          77     78       66       30     83       58
5/3/2017          79     82       68       35     85       60

In [7]:
df.pivot(index='date', columns='city', values='humidity')

city      beijing  mumbai  new york
date
5/1/2017       26      80        56
5/2/2017       30      83        58
5/3/2017       35      85        60

In [8]:
df.pivot(index='humidity', columns='city')

              date                     temperature
city       beijing    mumbai  new york     beijing mumbai new york
humidity
26        5/1/2017       NaN       NaN        80.0    NaN      NaN
30        5/2/2017       NaN       NaN        77.0    NaN      NaN
35        5/3/2017       NaN       NaN        79.0    NaN      NaN
56             NaN       NaN  5/1/2017         NaN    NaN     65.0
58             NaN       NaN  5/2/2017         NaN    NaN     66.0
60             NaN       NaN  5/3/2017         NaN    NaN     68.0
80             NaN  5/1/2017       NaN         NaN   75.0      NaN
83             NaN  5/2/2017       NaN         NaN   78.0      NaN
85             NaN  5/3/2017       NaN         NaN   82.0      NaN

# pivot_table()

In [9]:
df = pd.read_csv("../../data/weather2.csv")
df

       date      city  temperature  humidity
0  5/1/2017  new york           65        56
1  5/1/2017  new york           61        54
2  5/2/2017  new york           70        60
3  5/2/2017  new york           72        62
4  5/1/2017    mumbai           75        80
5  5/1/2017    mumbai           78        83
6  5/2/2017    mumbai           82        85
7  5/2/2017    mumbai           80        26

In [11]:
# taking an average
df.pivot_table(index='city', columns='date')

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai       81.5     55.5        76.5     81.0
new york     55.0     61.0        63.0     71.0

In [12]:
# taking the max val
# it uses numpy functions: https://numpy.org/doc/stable/reference/routines.math.html
df.pivot_table(index='city', columns='date', aggfunc="max")

         humidity          temperature
date     5/1/2017 5/2/2017    5/1/2017 5/2/2017
city
mumbai         83       85          78       82
new york       56       62          65       72

In [13]:
df.pivot_table(index='city', columns='date', aggfunc="diff")

   humidity  temperature
1        -2           -4
3         2            2
5         3            3
7       -59           -2

In [14]:
df.pivot_table(index='city', columns='date', margins=True)

         humidity                 temperature
date     5/1/2017 5/2/2017    All    5/1/2017 5/2/2017     All
city
mumbai      81.50    55.50  68.50       76.50     81.0  78.750
new york    55.00    61.00  58.00       63.00     71.0  67.000
All         68.25    58.25  63.25       69.75     76.0  72.875

# grouper()

In [16]:
df = pd.read_csv("../../data/weather3.csv")
df

        date      city  temperature  humidity
0   5/1/2017  new york           65        56
1   5/2/2017  new york           61        54
2   5/3/2017  new york           70        60
3  12/1/2017  new york           30        50
4  12/2/2017  new york           28        52
5  12/3/2017  new york           25        51

In [21]:
# must convert date to date_type for Grouper by Month to work.
df['date']=pd.to_datetime(df['date'])
df

        date      city  temperature  humidity
0 2017-05-01  new york           65        56
1 2017-05-02  new york           61        54
2 2017-05-03  new york           70        60
3 2017-12-01  new york           30        50
4 2017-12-02  new york           28        52
5 2017-12-03  new york           25        51

In [22]:
# M as month.
df.pivot_table(index=pd.Grouper(freq='M', key='date'), columns='city')

             humidity temperature
city         new york    new york
date
2017-05-31  56.666667   65.333333
2017-12-31  51.000000   27.666667

# Crosstab
* https://www.youtube.com/watch?v=TIG3T-I7s04&t=9s
* basically the same as pivot(), except crosstab works with lists of data, pivot works with dataframe.

In [23]:
res_names = ['FC', 'LL', 'FC', '5C', 'TS', 'FC', '5C']
purchase_type = ['Food', 'Food', 'Food', 'Drink', 'Food', 'Drink', 'Drink']
price = [12, 25, 32, 10, 15, 22, 18]

print ('Restaurant Names: {}'.format(res_names))
print ('Purchase Type: {}'.format(purchase_type))
print ('Price: {}'.format(price))

Restaurant Names: ['FC', 'LL', 'FC', '5C', 'TS', 'FC', '5C']
Purchase Type: ['Food', 'Food', 'Food', 'Drink', 'Food', 'Drink', 'Drink']
Price: [12, 25, 32, 10, 15, 22, 18]

In [26]:
# by default, it just gives the count
pd.crosstab(index=[res_names], columns=[purchase_type])

col_0  Drink  Food
row_0
5C         2     0
FC         1     2
LL         0     1
TS         0     1

In [27]:
# by default, it just gives the count
pd.crosstab(index=[res_names], columns=[purchase_type], values=price, aggfunc=sum)

col_0  Drink  Food
row_0
5C      28.0   NaN
FC      22.0  44.0
LL       NaN  25.0
TS       NaN  15.0

In [28]:
pd.crosstab(index=[res_names],
            columns=[purchase_type],
            values=price,
            aggfunc=lambda x: x.sum()**2, # Setting a custom agg function
            rownames=["Restaurants"], # Giving a title to my rows
            colnames=['Food Types'], # Giving a title to my columns
            margins=True, # Adding margins (Subtotals on the ends)
            margins_name="Totals") # Give my subtotals a title

Food Types    Drink    Food  Totals
Restaurants
5C            784.0     NaN     784
FC            484.0  1936.0    4356
LL              NaN   625.0     625
TS              NaN   225.0     225
Totals       2500.0  7056.0   17956

# replace()

In [2]:
technologies= {
    'Courses':["Spark","PySpark","Hadoop","Python","Pandas"],
    'Fee' :[22000,25000,23000,24000,26000],
    'Duration':['30days','50days','30days', None,np.nan],
    'Discount':[1000,2300,1000,1200,2500]
          }
df = pd.DataFrame(technologies)
df

   Courses    Fee Duration  Discount
0    Spark  22000   30days      1000
1  PySpark  25000   50days      2300
2   Hadoop  23000   30days      1000
3   Python  24000     None      1200
4   Pandas  26000      NaN      2500

In [3]:
dict = {"Spark" : 'S', "PySpark" : 'P', "Hadoop": 'H', "Python" : 'P', "Pandas": 'P'}
df2=df.replace({"Courses": dict})
df2

  Courses    Fee Duration  Discount
0       S  22000   30days      1000
1       P  25000   50days      2300
2       H  23000   30days      1000
3       P  24000     None      1200
4       P  26000      NaN      2500

# Sort

In [34]:
d = {"one": [1.0, 2.0, 3.0, 4.0], "two": [4.0, 3.0, 2.0, 1.0]}
df_d = pd.DataFrame(d)
df_d.sort_values('two')

   one  two
3  4.0  1.0
2  3.0  2.0
1  2.0  3.0
0  1.0  4.0

In [5]:
df = pd.DataFrame()  
df['tmx_smry_rs_cd_drvd'] = 'NORMAL'
df

Empty DataFrame
Columns: [tmx_smry_rs_cd_drvd]
Index: []

In [14]:
display(df)

                              0
tmx_smry_rs_cd_drvd      NORMAL
tmx_summary_reason_code

In [12]:
s1 = {'tmx_smry_rs_cd_drvd': 'NORMAL', 'tmx_summary_reason_code': ''}
df = pd.DataFrame({0: s1})
df

                              0
tmx_smry_rs_cd_drvd      NORMAL
tmx_summary_reason_code

In [15]:
df.index

Index(['tmx_smry_rs_cd_drvd', 'tmx_summary_reason_code'], dtype='object')

In [26]:
tmx_smry_rs_cd_drvd = ['NORMAL']
tmx_summary_reason_code = ["NEGATIVE"]
account_email_attributes = ['FAILED']
  
auth_series = pd.Series(tmx_smry_rs_cd_drvd)
article_series = pd.Series(tmx_summary_reason_code)
  
frame = { 'tmx_smry_rs_cd_drvd': auth_series, 'tmx_summary_reason_code': article_series, 'account_email_attributes': account_email_attributes}
  
df = pd.DataFrame(frame)
# age = [21, 21, 24, 23]
  
# result['Age'] = pd.Series(age)
  
print(df)

  tmx_smry_rs_cd_drvd tmx_summary_reason_code account_email_attributes
0              NORMAL                NEGATIVE                   FAILED

In [21]:
# https://www.geeksforgeeks.org/ways-to-apply-an-if-condition-in-pandas-dataframe/
# if-else in dataframe.loc[]
df.loc[df['tmx_summary_reason_code'].str.upper().str.contains('NEGATIVE'),'tmx_smry_rs_cd_drvd'] = 'NEGATIVE'

In [22]:
df

  tmx_smry_rs_cd_drvd tmx_summary_reason_code
0            NEGATIVE                NEGATIVE

In [27]:
riskkey1 = ['FAILED','THREAT','FRAUD_CONF','FRAUD_PROB','FALSE_NEGATIVE','FRAUD_BREACH']
neutralkey1 = ['WATCH','TRUSTED_PROB','REVIEWED','LOAN_APP','LOCK']
df['acct_em_attr_drvd'] = 'NORMAL'
df.loc[df['account_email_attributes'].str.upper().str.contains('|'.join(neutralkey1)),'acct_em_attr_drvd'] = 'NEUTRAL'
df.loc[df['account_email_attributes'].str.upper().str.contains('|'.join(riskkey1)),'acct_em_attr_drvd'] = 'HIGH_RISK'
df.loc[df['account_email_attributes']=='','acct_em_attr_drvd']= ''
df

,tmx_smry_rs_cd_drvd,tmx_summary_reason_code,account_email_attributes,acct_em_attr_drvd
0,NORMAL,NEGATIVE,FAILED,HIGH_RISK

In [28]:
'|'.join(neutralkey1)

'WATCH|TRUSTED_PROB|REVIEWED|LOAN_APP|LOCK'

In [29]:
'FAILED'.contains('|'.join(neutralkey1))

AttributeError: 'str' object has no attribute 'contains'

# where

In [4]:
d = {"A": [1.0, 2.0, 0.0, 4.0], "B": [4.0, 3.0, 2.0, 1.0]}
df = pd.DataFrame(d)
df

     A    B
0  1.0  4.0
1  2.0  3.0
2  0.0  2.0
3  4.0  1.0

In [6]:
# https://stackoverflow.com/questions/51787247/pandas-update-column-values-from-another-column-if-criteria
# if A has a row of 0, use B's value
df.A = np.where(df.A.eq(0), df.B, df.A)
df

     A    B
0  1.0  4.0
1  2.0  3.0
2  2.0  2.0
3  4.0  1.0

In [9]:
d = {"A": [1.0, 2.0, 0.0, 4.0], "B": [4.0, 3.0, 2.0, 1.0]}
df = pd.DataFrame(d)

df['A'] = df.apply(lambda x: x['B'] if x['A']==0 else x['A'], axis=1)
df

     A    B
0  1.0  4.0
1  2.0  3.0
2  2.0  2.0
3  4.0  1.0

In [45]:
d = {"email": ['ok, than this option... my address is zarnca@gmail.com', 'email me at <chris_veysseyre@hotmail.com>', 'here is my email', 'call me at 4568975643'], 
     "y": [1.0, 0.0, 0.0, 0.0]}
df = pd.DataFrame(d)
df

                                               email    y
0  ok, than this option... my address is zarnca@g...  1.0
1          email me at <chris_veysseyre@hotmail.com>  0.0
2                                   here is my email  0.0
3                              call me at 4568975643  0.0

In [8]:
df.y = np.where(df.email and df.y < 0.5, 1, df.y)
df

                                               email    y
0  ok, than this option... my address is zarnca@g...  1.0
1          email me at <chris_veysseyre@hotmail.com>  1.0
2                                   here is my email  1.0
3                              call me at 4568975643  1.0

In [15]:
df['y'] = df.apply(lambda x: 1.0 if x['y'] < 0.5 else x['y'], axis=1)
df

                                               email    y
0  ok, than this option... my address is zarnca@g...  1.0
1          email me at <chris_veysseyre@hotmail.com>  1.0
2                                   here is my email  1.0
3                              call me at 4568975643  1.0

In [23]:
import re

pattern = '^a...s$'
test_string = 'abyss'
result = re.match(pattern, test_string)
bool(result)

True

In [38]:
(bool(re.search('<\S+@\S+>', 'email me at <chris_veysseyre@hotmail.com>')), 
bool(re.search('<\S+@\S+>', 'email me at chris_veysseyre@hotmail.com')),
bool(re.search('<\S+@\S+>', 'chris_veysseyre@hotmail.com')),
re.search('<\S+@\S+>', 'chris_veysseyre@hotmail.com'))

(True, False, False, None)

In [46]:
import re

df['newy'] = df.apply(lambda x: 1.0 if x['y'] < 0.5 and bool(re.search('<\S+@\S+>', x['email'])) else x['y'], axis=1)
df

                                               email    y  newy
0  ok, than this option... my address is zarnca@g...  1.0   1.0
1          email me at <chris_veysseyre@hotmail.com>  0.0   1.0
2                                   here is my email  0.0   0.0
3                              call me at 4568975643  0.0   0.0

In [48]:
len(df.loc[df['y'] != df['newy']])

1